{
  "ruleNameList": [
    {
      "id": "R001",
      "sendNotification": "true",
      "ruleName": "ENABLE_HTTPS",
      "displayName": "Enable Only-HTTPS connection",
      "subjectLine": "Cloud Security Governance: Enable Only-HTTPS notification",
      "bodyContent": "The following azure service is automatically configured to accept only secure connection request i.e. only HTTPS. No further action is needed from your end.",
      "description": "Azure PaaS service is now configured to accept only secure transfer connection request",
      "auditDescription": "Azure PaaS service should be configured to accept only secure transfer connection request",
      "HICF": "09.m-1,09.s-1,09.s-1,09.s-2,09.s-2,09.s-9,09.t-10,09.t-10,09.t-5,09.v-1,09.v-1,09.v-2,09.v-2,09.v-3,09.v-4,09.v-5,09.v-5,09.w-1,09.w-1,09.x-1,09.x-2,09.y-1,09.y-2,10.d-2,10.d-2,9.06,9.09"
    },
    {
      "id": "R002",
      "sendNotification": "true",
      "ruleName": "CONTROL_VNET",
      "displayName": "Attach Control VNet",
      "subjectLine": "Cloud Security Governance: Attach Control Virtual Network Notification",
      "bodyContent": "The following Azure service firewall is automatically enabled and the regional control virtual networks is attached to the service. No further action is needed from your end.",
      "description": "Azure PaaS service firewall is enabled and a regional control virtual network is attached to it",
      "auditDescription": "Azure PaaS service firewall should be attached to a regional control virtual network",
      "HICF": "01.n-2,01.o-1,09.m-1,09.m-2,9.06"
    },
    {
      "id": "R003",
      "sendNotification": "true",
      "ruleName": "FIREWALL_ACL",
      "displayName": "PaaS Service Firewall ACL",
      "subjectLine": "Cloud Security Governance: PaaS Service Firewall ACL Notification",
      "bodyContent": "The firewall setting for the Azure PaaS service has been automatically enabled and the configured IP addresses has been added to the ACL. No further action is needed from your end.",
      "description": "Firewall for the PaaS service is enabled and the configured IP addresses has been added to the ACL",
      "auditDescription": "Firewall for the PaaS service should be configured with the IP addresses as specified within the json file",
      "HICF": "01.i-1,01.i-2,01.l-1,01.m-1,01.m-2,01.n-1,01.n-2,01.n-3,01.o-1,01.o-1,01.o-2,01.o-3,01.x-3,09.m-1,09.m-1,09.m-2,1.04,9.06"
    },
    {
      "id": "R004",
      "sendNotification": "true",
      "ruleName": "ENABLE_DIAGNOSTICS",
      "displayName": "Enable diagnostics logs",
      "subjectLine": "Cloud Security Governance: Diagnostic Logs notification",
      "bodyContent": "The diagnostics logs setting is automatically created for the following Azure service and the diagnostics logs are streamed to the regional log analytics workspace. No further action is needed from your end.",
      "description": "Diagnostic logs is automatically added to the Azure service",
      "auditDescription": "Diagnostic logs should be addded added to the Azure service",
      "HICF": "09.aa-1,09.aa-3,09.ab-1,09.ab-2,09.ad-1,09.ad-2,09.ae-1,09.ae-2,9.1"
    },
    {
      "id": "R005",
      "sendNotification": "true",
      "ruleName": "CRON_TAB_UPDATE",
      "displayName": "Cron tab expression update",
      "subjectLine": "Cloud Security Governance: Cron tab update notification",
      "bodyContent": "The following function app's cron tab expression is automatically updated to the value as specified within the configuration  . No further action is needed from your end.",
      "description": "The cron tab expression for the continuous running function app is updated as per the configuration",
      "auditDescription": "The cron tab expression for the continuous running function app should be updated as per the configuration",
      "HICF": "10.02,10.b-1,10.b-2,10.b-4,10.c-1,10.c-2,10.e -1,10.e -2"
    },
    {
      "id": "R006",
      "sendNotification": "true",
      "ruleName": "NSG_RULE_DELETE",
      "displayName": "NSG Inbound rule deletion",
      "subjectLine": "Cloud Security Governance: NSG Inbound Rule Notification",
      "bodyContent": "The inbound rule created within the following NSG service has been automatically deleted since it was not part of the JSON configuration. No further action is needed from your end.",
      "description": "The NSG inbound rule has been deleted since it was not part of the JSON configuration",
      "auditDescription": "The NSG inbound rule should be deleted since it is not part of the JSON configuration",
      "HICF": "01.i-1,01.i-2,01.l-1,01.m-1,01.m-2,01.n-1,01.n-2,01.n-3,01.o-1,01.o-1,01.o-2,01.o-3,01.x-3,09.m-1,09.m-1,09.m-2,1.04,9.06"
    },
    {
      "id": "R007",
      "sendNotification": "true",
      "ruleName": "ENABLE_MMA",
      "displayName": "MMA Monitoring",
      "subjectLine": "Cloud Security Governance: MMA Monitoring Switch",
      "bodyContent": "The MMA monitoring installation configuration is set to 'Enabled' within the Security center settings. No further action is needed from your end.",
      "description": "The MMA monitoring switch should be set to 'ON' within security center",
      "auditDescription": "The MMA monitoring switch is set to 'ON' within security center",
      "HICF": "9.1,09.ab-1,09.ab-2"
    },
    {
      "id": "R008",
      "sendNotification": "true",
      "ruleName": "SETUP_SECURITY_PRICING",
      "displayName": "Security Center Pricing Tier",
      "subjectLine": "Cloud Security Governance: Security Center Pricing Tiers Notification",
      "bodyContent": "The security center pricing tiers for the following service is set to the pricing tier as defined within the configuration. No further action is needed from your end.",
      "description": "Security center pricing tier for the services is set to the value as defined within the configuration",
      "auditDescription": "Security center pricing tier for the services should be set to the value as defined within the configuration",
      "HICF": "09.aa-1,09.aa-3,09.ab-1,09.ab-2,09.ad-1,09.ad-2,09.ae-1,09.ae-2,9.1"
    },
    {
      "id": "R009",
      "sendNotification": "true",
      "ruleName": "SECURITY_CONTACT_DETAILS",
      "displayName": "Security Center Contact Details",
      "subjectLine": "Cloud Security Governance: Security Center Contact notification",
      "bodyContent": "The security center contact details viz., email address and phone number are updated with the values as defined within the configuration. No further action is needed from your end.",
      "description": "Security contact details are updated with the values as defined within the configuration",
      "auditDescription": "Security contact details should be updated with the values as defined within the configuration",
      "HICF": "05.f-2,11.01,11.02,11.a-1,11.a-2,11.a-3,11.a-5,11.b-1,11.b-2,11.c-3,11.c-4,11.c-5,11.d-1"
    },
    {
      "id": "R010",
      "sendNotification": "true",
      "ruleName": "ASSIGN_AAD_GROUP",
      "displayName": "Assign Active Directory Group",
      "subjectLine": "Cloud Security Governance: SQL Service Admin Notification",
      "bodyContent": "The following SQL service admin is automatically set to the Active directory group as specified within the configuraiton. No further action is needed from your end.",
      "description": "The configured Active directory group is assigned as the administrator for the SQL service",
      "auditDescription": "The configured Active directory group should be assigned as the administrator for the SQL service",
      "HICF": "01.a-4,01.b-1,01.b-11,01.b-2,01.b-3,01.b-9,01.s-1,01.s-2,06.j-1,06.j-2,09.ac-2,1.02"
    },
    {
      "id": "R011",
      "sendNotification": "true",
      "ruleName": "SQL_ADVANCED_SECURITY",
      "displayName": "SQL Advanced Security Setting",
      "subjectLine": "Cloud Security Governance: SQL Advanced Security Notification",
      "bodyContent": "Advanced security setting is now automatically enabled for the following SQL PaaS service. No further action is needed from your end.",
      "description": "Advanced security setting is now enabled for the SQL PaaS service",
      "auditDescription": "Advanced security setting should be enabled for the SQL PaaS service",
      "HICF": "06.c-2,07.d-1,07.d-2,07.e -1,07.e -2,07.e -3,07.e -4,09.ab-1,09.ab-2,09.q-1,09.q-2,09.t-3,09.t-8,11.01,7.02,9.1"
    },
    {
      "id": "R012",
      "sendNotification": "true",
      "ruleName": "CONTAINER_ACCESS_POLICY",
      "displayName": "Container access policy update",
      "subjectLine": "Cloud Security Governance: Container access policy notification",
      "bodyContent": "The following azure storage container is automatically updated to the access policy as specified within the configuration. No further action is needed from your end.",
      "description": "Azure Storage container access policy is set to as per the configuration",
      "auditDescription": "Azure Storage container access policy should be set as per the configuration",
      "HICF": "01.i-1,01.i-2,01.l-1,01.n-1,01.n-2,01.n-3,01.o-1,09.m-2,1.04"
    },
    {
      "id": "R013",
      "sendNotification": "true",
      "ruleName": "ENABLE_SOFT_DELETE",
      "displayName": "Enable Soft Delete for Paas Service",
      "subjectLine": "Cloud Security Governance: Soft Delete Notification",
      "bodyContent": "Soft delete is now enabled for the following Azure PaaS service and the retention period is set as per the configuration. No further action is needed from your end.",
      "description": "Soft delete feature is now enabled for the PaaS service",
      "auditDescription": "Soft delete feature should be enabled for the PaaS service",
      "HICF": "09.l-1,09.l-2,09.l-3,09.l-5,09.r-1,12.c-7,9.05"
    },
    {
      "id": "R014",
      "sendNotification": "true",
      "ruleName": "REVOKE_GLOBAL_ADMIN_ROLE",
      "displayName": "Revoke Global Admin Role",
      "subjectLine": "Cloud Security Governance: Revoking of global admin role notification",
      "bodyContent": "The Global Admin role has been automatically revoked for the following users/SPNs. No further action is needed from your end.",
      "description": "Global Admin role has been automatically revoked for the non whitelisted users",
      "auditDescription": "Global Admin role has been automatically revoked for the non whitelisted users",
      "HICF": "01.a-4,01.b-1,01.b-11,01.b-2,01.b-3,01.b-9,01.q-1,01.q-2,1.02"
    },
    {
      "id": "R015",
      "sendNotification": "true",
      "ruleName": "JSON_CONFIG_SCHEMA_CHANGE",
      "displayName": "Invalid JSON Config",
      "subjectLine": "WARNING-Cloud Security Governance: Invalid JSON Config notification",
      "bodyContent": "The below JSON file has been updated with invalid content and immediately needs to be fixed. Failure to do so will result in remediation logic for corresponding service to malfunction",
      "description": "The JSON data for the configuration file does not adhere to the corresponding JSON SCHEMA",
      "auditDescription": "The JSON data for the configuration file does not adhere to the corresponding JSON SCHEMA",
      "HICF": "10.02,10.b-1,10.b-2,10.b-4,10.c-1,10.c-2,10.e -1,10.e -2"
    },
    {
      "id": "R016",
      "sendNotification": "true",
      "ruleName": "ALLOW_AZURE_SERVICES",
      "displayName": "Allow other Azure services to connect",
      "subjectLine": "Cloud Security Governance: Allow Services to Connect Notification",
      "bodyContent": "The following azure service is automatically set to allow other azure services to connect to it. No further action is needed from your end.",
      "description": "Azure PaaS service firewall is enabled and the service set to allow other azure services to connect to it",
      "auditDescription": "Azure PaaS service firewall should set to allow other azure services to connect to it",
      "HICF": "01.i-1,01.i-2,01.l-1,01.n-1,01.n-2,01.n-3,01.o-1,09.m-2,1.04"
    },
    {
      "id": "R017",
      "sendNotification": "true",
      "ruleName": "PAAS_SERVICE_ENDPOINTS",
      "displayName": "Enable PaaS service endpoints",
      "subjectLine": "Cloud Security Governance: Subnet - PaaS service endpoints notification",
      "bodyContent": "The following subnet is automatically remediated to have all the secure service endpoints enabled. No further action is needed from your end.",
      "description": "The PaaS service endpoints are enabled for the subnet",
      "auditDescription": "The PaaS service endpoints should be enabled for the subnet",
      "HICF": "01.i-1,01.i-2,01.l-1,01.n-1,01.n-2,01.n-3,01.o-1,09.m-2,1.04"
    },
    {
      "id": "R018",
      "sendNotification": "true",
      "ruleName": "REGENERATE_EVENT_HUB_KEYS",
      "displayName": "",
      "subjectLine": "Cloud Security Governance: ",
      "bodyContent": ". No further action is needed from your end.",
      "description": "This rule is to ensure event hub and event hub namepsace keys are rotated as per the configured time interval",
      "auditDescription": "This rule is to ensure event hub and event hub namepsace keys are rotated as per the configured time interval",
      "HICF": ""
    },
    {
      "id": "R019",
      "sendNotification": "true",
      "ruleName": "EVENT_SUB_CREATION",
      "displayName": "Event Grid Creation",
      "subjectLine": "Cloud Security Governance: Event Grid Notification",
      "bodyContent": "The following event grid subscription is automatically created for the new subscription added to the tenant. No further action is needed from your end.",
      "description": "A new Event grid subscription is created for the new subscription detected within the tenant",
      "auditDescription": "A new Event grid subscription is created for the new subscription detected within the tenant",
      "HICF": ""
    },
    {
      "id": "R020",
      "sendNotification": "true",
      "ruleName": "DISASSOCIATE_PUBLIC_IP",
      "displayName": "Disassociate Public IP",
      "subjectLine": "Cloud Security Governance: Disassociate Public IP Notification",
      "bodyContent": "Public IPs has been automatically removed from the following Azure VM/Load Balancer service. No further action is needed from your end.",
      "description": "Public IPs are removed from Azure VM/Load Balancer",
      "auditDescription": "Public IPs should be removed from Azure VM/Load Balancer",
      "HICF": "01.i-1,01.i-2,01.l-1,01.n-1,01.n-2,01.n-3,01.o-1,09.m-1,09.m-2,09.m-2,1.04,9.06"
    },
    {
      "id": "R021",
      "sendNotification": "true",
      "ruleName": "ENABLE_VM_DIAGNOSTICS",
      "displayName": "Enable Diagnostics setting for VM/VMSS",
      "subjectLine": "Cloud Security Governance: VM/VMSS Diagnostics Logs notification",
      "bodyContent": "The following VM/VMSS resource has been automatically assigned a diagnostic log setting which stream the logs to the storage account. No further action is needed from your end.",
      "description": "Azure Virtual Machine diagnostics logs are now enabled and connected with the Storage Account",
      "auditDescription": "Azure Virtual Machine diagnostics logs should be enabled and connected with the Storage Account",
      "HICF": "09.aa-1,09.aa-3,09.ad-1,09.ad-2,09.ae-1,09.ae-2"
    },
    {
      "id": "R022",
      "sendNotification": "true",
      "ruleName": "ENABLE_VM_MMA_LOGGING",
      "displayName": "VM Monitoring Agent Logs",
      "subjectLine": "Cloud Security Governance: VM MMA Agent Log Notification",
      "bodyContent": "The security center property to allow MMA agent to be installed on the VM is automatically enabled. No further action is needed from your end.",
      "description": "The MMA for Azure Virtual machine is now connected to the regional log analytics workspace",
      "auditDescription": "The MMA for Azure Virtual machine should be connected to the regional log analytics workspace",
      "HICF": "9.1,09.ab-1,09.ab-2"
    },
    {
      "id": "R023",
      "sendNotification": "true",
      "ruleName": "SECURITY_ALERT_EMAIL_ADMIN",
      "displayName": "Security Center Admin Alert configuration",
      "subjectLine": "Cloud Security Governance: Security Center Notification",
      "bodyContent": "The security center property to send alerts to the Admin is automatically enabled. No further action is needed from your end.",
      "description": "Security center setting is now updated to enable the send security alert emails to the Admin",
      "auditDescription": "Security center setting should be updated to enable the send security alert emails to the Admin",
      "HICF": "05.f-2,11.01,11.02,11.a-1,11.a-2,11.a-3,11.a-5,11.b-1,11.b-2,11.c-3,11.c-4,11.c-5,11.d-1"
    },
    {
      "id": "R024",
      "sendNotification": "true",
      "ruleName": "SECURITY_ALERT_EMAIL",
      "displayName": "Security Center Alert configuration",
      "subjectLine": "Cloud Security Governance: Security Center Notification",
      "bodyContent": "The security center property to send alerts is automatically enabled. No further action is needed from your end.",
      "description": "Security center setting is now updated to enable the send security alert emails property",
      "auditDescription": "Security center setting should be updated to enable the send security alert emails property",
      "HICF": "05.f-2,11.01,11.02,11.a-1,11.a-2,11.a-3,11.a-5,11.b-1,11.b-2,11.c-3,11.c-4,11.c-5,11.d-1"
    },
    {
      "id": "R025",
      "sendNotification": "true",
      "ruleName": "SETUP_CONTROL_VNET_FOR_STORAGE",
      "displayName": "Storage Account Control VNet",
      "subjectLine": "Cloud Security Governance: Storage Account Control VNet Notification",
      "bodyContent": "The following storage account has been automatically attached to the control virtual network which is created with the same name. No further action is needed from your end.",
      "description": "The storage account is now associated to a control virtual network which is created with the same name",
      "auditDescription": "The storage account should be associated to a control virtual network which is to be created with the same name",
      "HICF": "01.i-1,01.i-2,01.l-1,01.n-1,01.n-2,01.n-3,01.o-1,09.m-2,1.04"
    },
    {
      "id": "R026",
      "sendNotification": "true",
      "ruleName": "MINIMUM_TLS_VERSION",
      "displayName": "Setup Minimum TLS version",
      "subjectLine": "Cloud Security Governance: Setup Minimum TLS version",
      "bodyContent": "The following PaaS service is automatically set to the TLS version as specified within the configuration. No further action is needed from your end.",
      "description": "The minimum TLS version of the PaaS service is set to the configured value",
      "auditDescription": "The minimum TLS version of the PaaS service should be set to the configured value",
      "HICF": "09.s-1,09.s-2,09.s-9,09.t-10,09.v-1,09.v-2,09.v-5,09.w-1,10.d-2"
    },
    {
      "id": "R027",
      "sendNotification": "true",
      "ruleName": "PROTOCOL_SETTINGS",
      "displayName": "API Management service protocol settings",
      "subjectLine": "Cloud Security Governance: API Management service protocol settings",
      "bodyContent": "The following API management service is automatically set to the protocol settings as defined within the configuration. The service might take 30-45 minutes to reflect the changes. No further action is needed from your end.",
      "description": "The protocol settings for the API management service is updated as per the configuration. Wait for 30-45 mins for the changes to reflect within the service",
      "auditDescription": "The protocol settings for the API management service should be updated as per the configuration",
      "HICF": "09.s-1,09.s-2,09.s-9,09.t-10,09.v-1,09.v-2,09.v-5,09.w-1,10.d-2"
    },
    {
      "id": "R028",
      "sendNotification": "true",
      "ruleName": "EVENT_GRID_EXCLUDED_SUBSCRIPTION",
      "displayName": "Event Grid Subscription Deleted",
      "subjectLine": "Cloud Security Governance: Event Grid Subscription Deleted",
      "bodyContent": "The following event grid subscription has been deleted which would disable all the remediation processes within this Azure subscription. No further action is needed from your end.",
      "description": "The event grid subscription is deleted to disable all remediation",
      "auditDescription": "The event grid subscription is deleted to disable all remediation",
      "HICF": ""
    },
    {
      "id": "R029",
      "sendNotification": "true",
      "ruleName": "NSG_FLOW_LOGS",
      "displayName": "Enable NSG flow logs",
      "subjectLine": "Cloud Security Governance: NSG Flow Logs notification",
      "bodyContent": "The following NSG resource has been automatically assigned a flow log setting which streams the logs to the storage account. No further action is needed from your end.",
      "description": "Azure Network Security Group Flow logs are now enabled and connected with the Storage Account",
      "auditDescription": "Azure Network Security Group Flow logs should be enabled and connected with the Storage Account",
      "HICF": "01.i-1,01.i-2,01.l-1,01.n-1,01.n-2,01.n-3,01.o-1,09.m-2,1.04"
    },
    {
      "id": "R030",
      "sendNotification": "true",
      "ruleName": "REVOKE_GLOBAL_ADMIN_ROLE",
      "displayName": "Audit Mode - Misconfigured Global Admin Role",
      "subjectLine": "Cloud Security Governance: Audit notification for misconfigured global admin role",
      "bodyContent": "The Global Admin role assignment is not inline with the configuration for the following users/SPNs. Please review the assignments and take appropriate security measures.",
      "description": "Global Admin role assignment is not inline with the non whitelisted users",
      "auditDescription": "Global Admin role assignment is not inline with the non whitelisted users",
      "HICF": "01.a-4,01.b-1,01.b-11,01.b-2,01.b-3,01.b-9,01.q-1,01.q-2,1.02"
    },
    {
      "id": "R031",
      "sendNotification": "true",
      "ruleName": "ENABLE_DATA_BACKUP_CONTROL",
      "displayName": "Setup Backup Retention Days",
      "subjectLine": "Cloud Security Governance: Misconfigured Backup Retention Days notification",
      "bodyContent": "The following azure resource retention days as been automatically updated as per configuration. No further action is needed from your end.",
      "description": "The backup retention days value is updated for the paas service.",
      "auditDescription": "The backup retention days value should be updated for the paas service.",
      "HICF": "06.c-1,06.c-2,09.l-1,09.l-2,09.l-3,09.l-5,09.r-1,13.l-1,13.l-2,9.05"
    },
    {
      "id": "R032",
      "sendNotification": "true",
      "ruleName": "ENABLE_TRANSPARENT_DATA_ENCRYPTION",
      "displayName": "Enable Transparent Data Encryption",
      "subjectLine": "Cloud Security Governance: SQL database Transparent data encryption notification",
      "bodyContent": "Transparent data encryption has been automatically enabled for the following SQL database. No further action is needed from your end. ",
      "description": "Transparent Data Encryption is now enabled for the SQL database",
      "auditDescription": "Transparent Data Encryption should be enabled for the SQL database",
      "HICF": "06.d-5,06.d-6"
    },
    {
      "id": "R033",
      "sendNotification": "true",
      "ruleName": "ENABLE_INTRUSION_PREVENTION_CONTROL",
      "displayName": "Enable Intrusion Prevention Control",
      "subjectLine": "Cloud Security Governance: Misconfigured Intrusion Prevention Control",
      "bodyContent": "The following azure resource Intrusion Prevention Control as been automatically updated as per configuration. No further action is needed from your end.",
      "description": "The Intrusion Prevention Control is enabled for the paas service.",
      "auditDescription": "The Intrusion Prevention Control should be enabled for the paas service.",
      "HICF": "09.ab-1,09.ab-2,11.01,9.1"
    },
    {
      "id": "R034",
      "sendNotification": "true",
      "ruleName": "DISABLE_PUBLIC_ENDPOINT",
      "displayName": "Disable the public endpoint",
      "subjectLine": "Cloud Security Governance: Disabled the Public Enpoint for SQL Managed Instance",
      "bodyContent": "The following azure SQL managed instance public endpoint is disabled. No further action is needed from your end.",
      "description": "The public endpoint for the SQL managed instance is now disabled.",
      "auditDescription": "The public endpoint for the SQL managed instance should be disabled.",
      "HICF": "1.04,01.i-1,01.i-2,01.l-1,01.n-1,01.n-3,09.m-2"
    },
    {
      "id": "R035",
      "sendNotification": "true",
      "ruleName": "UPDATE_CONNECTION_TYPE",
      "displayName": "Update connection type",
      "subjectLine": "Cloud Security Governance: Updated the Connection type for SQL instance",
      "bodyContent": "The following azure SQL instance connection type has been automatically updated as per configuration. No further action is needed from your end.",
      "description": "The connection type for SQL instance is now updated.",
      "auditDescription": "The connection type for SQL instance should be updated as per the configured value.",
      "HICF": "01.m-1,01.m-2,01.o-1,01.o-2,01.o-3,01.x-3,9.06,09.m-1,09.m-2"
    },
    {
      "id": "R036",
      "sendNotification": "true",
      "ruleName": "ACCESS_POWER_BI",
      "displayName": "Allow POWER BI services to connect",
      "subjectLine": "Cloud Security Governance: Allow Services to Connect Notification",
      "bodyContent": "The following azure service is automatically set to allow powerBI services to connect to it. No further action is needed from your end.",
      "description": "Azure PaaS service firewall is enabled and the service set to allow other powerBI services to connect to it",
      "auditDescription": "Azure PaaS service firewall should be set to allow other powerBI services to connect to it",
      "HICF": ""
    },
    {
      "id": "R037",
      "sendNotification": "true",
      "ruleName": "PRIVATE_DNS_ZONE_VNET_LINKS",
      "displayName": "Remove VNET Links of a Private DNS Zone",
      "subjectLine": "Cloud Security Governance: Remove VNET Links of a Private DNS Zone",
      "bodyContent": "The following azure service is automatically set to remove its existing Virtual Network links. No further action is needed from your end.",
      "description": "Azure Prvate DNS Zones have its Virtual Network Links deleted",
      "auditDescription": "Azure Prvate DNS Zones should have its Virtual Network Links deleted",
      "HICF": ""
    },
    {
      "id": "R038",
      "sendNotification": "true",
      "ruleName": "ENABLE_AUTOSCALING",
      "displayName": "Enable the Auto scaling setting for Kubernetes Agent pool",
      "subjectLine": "Cloud Security Governance: Enable the Auto scaling setting for Kubernetes Agent pool",
      "bodyContent": "The following azure service has automatically set the Auto scaling property for agent pool to true. No further action is needed from your end.",
      "description": "Azure Kubernetes Agent pool has Auto scaling enabled",
      "auditDescription": "Azure Kubernetes Agent pool should have Auto scaling enabled",
      "HICF": "05.a-4,05.b-3"
    },
    {
      "id": "R039",
      "sendNotification": "true",
      "ruleName": "ENABLE_AUDITING",
      "displayName": "Enable Auditing",
      "subjectLine": "Cloud Security Governance: Enable Auditing of a PaaS Service",
      "bodyContent": "The following azure service is automatically set to enable auditing. No further action is needed from your end.",
      "description": "Azure PaaS service auditing is enabled",
      "auditDescription": "Azure PaaS service should have should have auditing enabled",
      "HICF": "09.aa-1,09.aa-2,09.aa-3,09.ad-1,09.ad-2,09.ae-1,09.ae-2"
    },
    {
      "id": "R040",
      "sendNotification": "true",
      "ruleName": "FTPS_STATE",
      "displayName": "Set the FTPS state",
      "subjectLine": "Cloud Security Governance: Set the FTPS state",
      "bodyContent": "The following app service is automatically set to the FTPS state as specified within the configuration. No further action is needed from your end.",
      "description": "The FTPS state of the app service is set to the configured value",
      "auditDescription": "The FTPS state of the app service should be set to the configured value",
      "HICF": "09.m-1,09.s-1,09.s-1,09.s-2,09.s-2,09.s-9,09.t-10,09.t-10,09.t-5,09.v-1,09.v-1,09.v-2,09.v-2,09.v-3,09.v-4,09.v-5,09.v-5,09.w-1,09.w-1,09.x-1,09.x-2,09.y-1,09.y-2,10.d-2,10.d-2,9.06,9.09"
    },
    {
      "id": "R041",
      "sendNotification": "true",
      "ruleName": "STACK_RUNTIME_VERSION",
      "displayName": "Set the App service stack runtime version",
      "subjectLine": "Cloud Security Governance: Set the App service stack runtime version",
      "bodyContent": "The following app service is automatically set to the stack runtime version as specified within the configuration. No further action is needed from your end.",
      "description": "The stack runtime version of the app service is set to the configured value",
      "auditDescription": "The Framework stack of the app service should be set to the configured value",
      "HICF": ""
    },
    {
      "id": "R042",
      "sendNotification": "true",
      "ruleName": "REMOTE_DEBUGGING",
      "displayName": "Set the Remote Debugging",
      "subjectLine": "Cloud Security Governance: Set the Remote Debugging",
      "bodyContent": "The following app service is automatically set to the Remote Debugging as specified within the configuration. No further action is needed from your end.",
      "description": "The Remote Debugging of the app service is set to the configured value",
      "auditDescription": "The Remote Debugging of the app service should be set to the configured value",
      "HICF": "01.j-4"
    },
    {
      "id": "R043",
      "sendNotification": "true",
      "ruleName": "ENABLE_ALWAYS_ON",
      "displayName": "Set the Always On property",
      "subjectLine": "Cloud Security Governance: Set the Always On property",
      "bodyContent": "The following app service is automatically set to the Always On as specified within the configuration. No further action is needed from your end.",
      "description": "The Always On property of the app service is set to the configured value",
      "auditDescription": "The Always On property of the app service should be set to the configured value",
      "HICF": ""
    },
    {
      "id": "R044",
      "sendNotification": "true",
      "ruleName": "ENABLE_SELECTED_NETWORK",
      "displayName": "Enable selected network switch",
      "subjectLine": "Cloud Security Governance: Enable selected network switch",
      "bodyContent": "The following Azure service firewall is automatically enabled. No further action is needed from your end.",
      "description": "Azure PaaS service firewall is now enabled",
      "auditDescription": "Azure PaaS service firewall should be enabled",
      "HICF": "01.n-2,01.o-1,09.m-1,09.m-2,9.06"
    },
    {
      "id": "R045",
      "sendNotification": "true",
      "ruleName": "RECOVER_AZURE_SERVICE",
      "displayName": "Recover deleted Azure service",
      "subjectLine": "Cloud Security Governance: Recover deleted Azure service",
      "bodyContent": "The following Azure service is automatically recovered. No further action is needed from your end.",
      "description": "The deleted Azure service is recovered",
      "auditDescription": "The deleted Azure service should be recovered",
      "HICF": "12.c-7"
    },
    {
      "id": "R046",
      "sendNotification": "true",
      "ruleName": "BLOB_VERSIONING",
      "displayName": "Modify blob versioning property",
      "subjectLine": "Cloud Security Governance: Modified blob versioning property",
      "bodyContent": "The versioning field for the following blob service is updated as per the configuration. No further action is needed from your end.",
      "description": "The blob versioning property is modified as per the configuration",
      "auditDescription": "The blob versioning property should be modified as per the configuration",
      "HICF": ""
    },
    {
      "id": "R047",
      "sendNotification": "true",
      "ruleName": "BLOB_CHANGE_FEED",
      "displayName": "Modify blob change feed property",
      "subjectLine": "Cloud Security Governance: Modified blob change feed property",
      "bodyContent": "The change feed field for the following blob service is updated as per the configuration. No further action is needed from your end.",
      "description": "The blob change feed property is modified as per the configuration",
      "auditDescription": "The blob change feed property should be modified as per the configuration",
      "HICF": "09.aa-1,09.aa-2,09.aa-3,09.ad-1,09.ad-2,09.ae-1,09.ae-2"
    },
    {
      "id": "R048",
      "sendNotification": "true",
      "ruleName": "SSL_ENFORCEMENT",
      "displayName": "Enforce SSL settings",
      "subjectLine": "Cloud Security Governance: Enforce SSL settings",
      "bodyContent": "The following PaaS service is automatically set to the SSL settings as specified within the configuration. No further action is needed from your end.",
      "description": "The SSL settings of the PaaS service is set to the configured value",
      "auditDescription": "The SSL settings of the PaaS service is set to the configured value",
      "HICF": "09.s-1,09.s-2,09.s-9,09.t-10,09.v-1,09.v-2,09.v-5,09.w-1,10.d-2"
    }
  ]
}